In [1]:
import numpy as np
import pandas as pd

In [2]:
def extract_city_name(df):
   .....:     """
   .....:     Chicago, IL -> Chicago for city_name column
   .....:     """
   .....:     df['city_name'] = df['city_and_code'].str.split(",").str.get(0)
   .....:     return df

In [3]:
def add_country_name(df, country_name=None):
   .....:     """
   .....:     Chicago -> Chicago-US for city_name column
   .....:     """
   .....:     col = 'city_name'
   .....:     df['city_and_country'] = df[col] + country_name
   .....:     return df

In [4]:
df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})

In [5]:
df_p

  city_and_code
0   Chicago, IL

In [6]:
add_country_name(extract_city_name(df_p), country_name='US')

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [11]:
df_p = pd.DataFrame({'city_and_code': ['Chicago, IL']})
df_p

  city_and_code
0   Chicago, IL

In [12]:
(df_p.pipe(extract_city_name)
         .pipe(add_country_name, country_name="US"))

  city_and_code city_name city_and_country
0   Chicago, IL   Chicago        ChicagoUS

In [13]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [14]:
df

        one       two     three
a -0.467217 -0.506573       NaN
b  0.246514 -0.399949  1.660931
c -0.603680  0.766452 -1.865824
d       NaN -1.189180 -0.810758

In [15]:
# pre-build numpy function
df.apply(np.mean)

one     -0.274795
two     -0.332312
three   -0.338550
dtype: float64

In [16]:
df.apply(np.mean, axis=1)

a   -0.486895
b    0.502498
c   -0.567684
d   -0.999969
dtype: float64

In [17]:
# own lambda function
df.apply(lambda x: x.max() - x.min())

one      0.850194
two      1.955632
three    3.526755
dtype: float64

In [18]:
df.apply(np.cumsum)

        one       two     three
a -0.467217 -0.506573       NaN
b -0.220704 -0.906522  1.660931
c -0.824384 -0.140070 -0.204893
d       NaN -1.329249 -1.015650

In [20]:
df.apply(np.exp)

        one       two     three
a  0.626744  0.602557       NaN
b  1.279557  0.670354  5.264211
c  0.546796  2.152118  0.154769
d       NaN  0.304471  0.444521

In [21]:
def own_function(x):
    return x*x

In [22]:
df.apply(own_function)

        one       two     three
a  0.218292  0.256616       NaN
b  0.060769  0.159959  2.758692
c  0.364430  0.587449  3.481299
d       NaN  1.414148  0.657328

In [24]:
def subtract_and_divide(x, sub, divide=1):
    return (x - sub) / divide

In [25]:
df.apply(subtract_and_divide, args=(5,3))

        one       two     three
a -1.822406 -1.835524       NaN
b -1.584495 -1.799983 -1.113023
c -1.867893 -1.411183 -2.288608
d       NaN -2.063060 -1.936919

In [27]:
def subtract(x, sub):
    return (x - sub)

In [28]:
df.apply(subtract, args=(5,))

        one       two     three
a -5.467217 -5.506573       NaN
b -4.753486 -5.399949 -3.339069
c -5.603680 -4.233548 -6.865824
d       NaN -6.189180 -5.810758